; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	image1 - mode
	spectrograph2 - mode
	thermograph3 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument5 image1)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite1 Star13)
	(pointing satellite2 Star11)
	(have_image Planet9 image0)
	(have_image Phenomenon10 image0)
	(have_image Star11 image1)
	(have_image Star12 image0)
	(have_image Star13 image1)
	(have_image Star14 spectrograph2)
))

)

; plan
1. (turn_to satellite2 star11 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star11)
   goals met: 1 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 8
3. (calibrate satellite1 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 1 of 8
4. (turn_to satellite1 star11 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star11)
   goals met: 1 of 8
5. (turn_to satellite0 star8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star8)
   goals met: 1 of 8
6. (take_image satellite1 star11 instrument4 image1)
   added: (have_image star11 image1)
   goals met: 2 of 8
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 8
8. (calibrate satellite0 instrument2 star8)
   added: (calibrated instrument2)
   goals met: 2 of 8
9. (turn_to satellite0 phenomenon10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 8
10. (take_image satellite0 phenomenon10 instrument2 image0)
   added: (have_image phenomenon10 image0)
   goals met: 3 of 8
11. (turn_to satellite0 planet9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet9)
   goals met: 3 of 8
12. (take_image satellite0 planet9 instrument2 image0)
   added: (have_image planet9 image0)
   goals met: 4 of 8
13. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 4 of 8
14. (take_image satellite0 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 5 of 8
15. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 5 of 8
16. (take_image satellite0 star14 instrument2 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 6 of 8
17. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 7 of 8
18. (take_image satellite1 star13 instrument4 image1)
   added: (have_image star13 image1)
   goals met: 8 of 8
